Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/atdf/PIC32CM5164JH01032.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="24" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="75" caption="Instance index for TCC2"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8" caption="Instance index for WDT"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="Supervisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable Service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC" caption="System peripherals shared interrupt"/>
        <interrupt name="WDT" index="1" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="2" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="3" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="FREQM" index="4" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="MCRAMC" index="5" module-instance="MCRAMC" caption="SRAM Memory Controller"/>
        <interrupt name="NVMCTRL" index="6" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="DMAC" index="7" module-instance="DMAC" caption="Direct Memory Access Controller"/>
        <interrupt name="EVSYS" index="8" module-instance="EVSYS" caption="Event Systems"/>
        <interrupt name="SERCOM0" index="9" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="10" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2" index="11" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3" index="12" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="CAN0" index="15" module-instance="CAN0" caption="Control Area Network 0"/>
        <interrupt name="TCC0" index="17" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TCC1" index="18" module-instance="TCC1" caption="Timer/Counter for Control Applications 1"/>
        <interrupt name="TCC2" index="19" module-instance="TCC2" caption="Timer/Counter for Control Applications 2"/>
        <interrupt name="TC0_5" index="20" module-instance="TC0 TC5" caption="Timer/Counter 0_5"/>
        <interrupt name="TC1_6" index="21" module-instance="TC1 TC6" caption="Timer/Counter 1_6"/>
        <interrupt name="TC2_7" index="22" module-instance="TC2 TC7" caption="Timer/Counter 2_7"/>
        <interrupt name="TC3" index="23" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="TC4" index="24" module-instance="TC4" caption="Timer/Counter 4"/>
        <interrupt name="ADC0" index="25" module-instance="ADC0" caption="Analog-to-Digital Converter 0"/>
        <interrupt name="ADC1" index="26" module-instance="ADC1" caption="Analog-to-Digital Converter 1"/>
        <interrupt name="AC" index="27" module-instance="AC" caption="Analog Comparators"/>
        <interrupt name="DAC" index="28" module-instance="DAC" caption="Digital-to-Analog Converter"/>
        <interrupt name="PDEC" index="29" module-instance="PDEC" caption="Position Decoder"/>
        <interrupt name="PTC" index="30" module-instance="PTC" caption="Peripheral Touch Controller"/>
        <interrupt name="ICM" index="31" module-instance="ICM" caption="Integrity Check Monitor"/>
      </interrupts>
      <events>
        <generators>
          <generator name="RTC_PERD" index="1" module-instance="RTC"/>
          <generator name="OSCCTRL_XOSC_FAIL" index="3" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="4" module-instance="OSC32KCTRL"/>
          <generator name="RTC_CMP_0" index="5" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="6" module-instance="RTC"/>
          <generator name="RTC_OVF" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_0" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="13" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="14" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="15" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="30" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="31" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="32" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="33" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="34" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="35" module-instance="DMAC"/>
          <generator name="TCC0_OVF" index="36" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="37" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="38" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="39" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="40" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="41" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="42" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="43" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="44" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="45" module-instance="TCC1"/>
          <generator name="TCC1_MC_0" index="46" module-instance="TCC1"/>
          <generator name="TCC1_MC_1" index="47" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="48" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="49" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="50" module-instance="TCC2"/>
          <generator name="TCC2_MC_0" index="51" module-instance="TCC2"/>
          <generator name="TCC2_MC_1" index="52" module-instance="TCC2"/>
          <generator name="TC0_OVF" index="53" module-instance="TC0"/>
          <generator name="TC0_MC_0" index="54" module-instance="TC0"/>
          <generator name="TC0_MC_1" index="55" module-instance="TC0"/>
          <generator name="TC1_OVF" index="56" module-instance="TC1"/>
          <generator name="TC1_MC_0" index="57" module-instance="TC1"/>
          <generator name="TC1_MC_1" index="58" module-instance="TC1"/>
          <generator name="TC2_OVF" index="59" module-instance="TC2"/>
          <generator name="TC2_MC_0" index="60" module-instance="TC2"/>
          <generator name="TC2_MC_1" index="61" module-instance="TC2"/>
          <generator name="TC3_OVF" index="62" module-instance="TC3"/>
          <generator name="TC3_MC_0" index="63" module-instance="TC3"/>
          <generator name="TC3_MC_1" index="64" module-instance="TC3"/>
          <generator name="TC4_OVF" index="65" module-instance="TC4"/>
          <generator name="TC4_MC_0" index="66" module-instance="TC4"/>
          <generator name="TC4_MC_1" index="67" module-instance="TC4"/>
          <generator name="ADC0_RESRDY" index="68" module-instance="ADC0"/>
          <generator name="ADC0_WINMON" index="69" module-instance="ADC0"/>
          <generator name="ADC1_RESRDY" index="70" module-instance="ADC1"/>
          <generator name="ADC1_WINMON" index="71" module-instance="ADC1"/>
          <generator name="AC_COMP_0" index="72" module-instance="AC"/>
          <generator name="AC_COMP_1" index="73" module-instance="AC"/>
          <generator name="AC_COMP_2" index="74" module-instance="AC"/>
          <generator name="AC_COMP_3" index="75" module-instance="AC"/>
          <generator name="AC_WIN_0" index="76" module-instance="AC"/>
          <generator name="AC_WIN_1" index="77" module-instance="AC"/>
          <generator name="DAC_EMPTY" index="78" module-instance="DAC"/>
          <generator name="PTC_EOC" index="79" module-instance="PTC"/>
          <generator name="PTC_WCOMP" index="80" module-instance="PTC"/>
          <generator name="CCL_LUTOUT_0" index="81" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="82" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="83" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="84" module-instance="CCL"/>
          <generator name="PAC_ACCERR" index="85" module-instance="PAC"/>
          <generator name="TC5_OVF" index="87" module-instance="TC5"/>
          <generator name="TC5_MC_0" index="88" module-instance="TC5"/>
          <generator name="TC5_MC_1" index="89" module-instance="TC5"/>
          <generator name="TC6_OVF" index="90" module-instance="TC6"/>
          <generator name="TC6_MC_0" index="91" module-instance="TC6"/>
          <generator name="TC6_MC_1" index="92" module-instance="TC6"/>
          <generator name="TC7_OVF" index="93" module-instance="TC7"/>
          <generator name="TC7_MC_0" index="94" module-instance="TC7"/>
          <generator name="TC7_MC_1" index="95" module-instance="TC7"/>
          <generator name="PDEC_OVF" index="96" module-instance="PDEC"/>
          <generator name="PDEC_ERR" index="97" module-instance="PDEC"/>
          <generator name="PDEC_DIR" index="98" module-instance="PDEC"/>
          <generator name="PDEC_VLC" index="99" module-instance="PDEC"/>
          <generator name="PDEC_MC_0" index="100" module-instance="PDEC"/>
          <generator name="PDEC_MC_1" index="101" module-instance="PDEC"/>
        </generators>
        <users>
          <user name="PORT_EV_0" index="1" module-instance="PORT"/>
          <user name="PORT_EV_1" index="2" module-instance="PORT"/>
          <user name="PORT_EV_2" index="3" module-instance="PORT"/>
          <user name="PORT_EV_3" index="4" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="8" module-instance="DMAC"/>
          <user name="TCC0_EV_0" index="9" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="10" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="11" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="12" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="14" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="15" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="16" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="17" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="18" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="19" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="20" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="21" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="22" module-instance="TCC2"/>
          <user name="TC0_EVU" index="23" module-instance="TC0"/>
          <user name="TC1_EVU" index="24" module-instance="TC1"/>
          <user name="TC2_EVU" index="25" module-instance="TC2"/>
          <user name="TC3_EVU" index="26" module-instance="TC3"/>
          <user name="TC4_EVU" index="27" module-instance="TC4"/>
          <user name="ADC0_START" index="28" module-instance="ADC0"/>
          <user name="ADC0_SYNC" index="29" module-instance="ADC0"/>
          <user name="ADC1_START" index="30" module-instance="ADC1"/>
          <user name="ADC1_SYNC" index="31" module-instance="ADC1"/>
          <user name="AC_SOC_0" index="32" module-instance="AC"/>
          <user name="AC_SOC_1" index="33" module-instance="AC"/>
          <user name="AC_SOC_2" index="34" module-instance="AC"/>
          <user name="AC_SOC_3" index="35" module-instance="AC"/>
          <user name="DAC_START" index="36" module-instance="DAC"/>
          <user name="PTC_STCONV" index="37" module-instance="DAC"/>
          <user name="CCL_LUTIN_0" index="38" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="39" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="40" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="41" module-instance="CCL"/>
          <user name="MTB_START" index="43" module-instance="MTB"/>
          <user name="MTB_STOP" index="44" module-instance="MTB"/>
          <user name="TC5_EVU" index="45" module-instance="TC5"/>
          <user name="TC6_EVU" index="46" module-instance="TC6"/>
          <user name="TC7_EVU" index="47" module-instance="TC7"/>
          <user name="PDEC_EVU_0" index="48" module-instance="PDEC"/>
          <user name="PDEC_EVU_1" index="49" module-instance="PDEC"/>
          <user name="PDEC_EVU_2" index="50" module-instance="PDEC"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x11060003"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
          <bitfield name="START2" caption="Comparator 2 Start Comparison" mask="0x4"/>
          <bitfield name="START3" caption="Comparator 3 Start Comparison" mask="0x8"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="COMPEO2" caption="Comparator 2 Event Output Enable" mask="0x4"/>
          <bitfield name="COMPEO3" caption="Comparator 3 Event Output Enable" mask="0x8"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="WINEO1" caption="Window 1 Event Output Enable" mask="0x20"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="COMPEI2" caption="Comparator 2 Event Input Enable" mask="0x400"/>
          <bitfield name="COMPEI3" caption="Comparator 3 Event Input Enable" mask="0x800"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
          <bitfield name="INVEI2" caption="Comparator 2 Input Event Invert Enable" mask="0x4000"/>
          <bitfield name="INVEI3" caption="Comparator 3 Input Event Invert Enable" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="COMP2" caption="Comparator 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="COMP3" caption="Comparator 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="WIN1" caption="Window 1 Interrupt Enable" mask="0x20"/>
        </register>
