Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/atdf/PIC32CM5164JH01032.atdf
        <register name="DEBOUNCEN" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Debouncer Enable">
          <bitfield name="DEBOUNCEN0" caption="Debouncer Enable of EXTINT0" mask="0x1"/>
          <bitfield name="DEBOUNCEN1" caption="Debouncer Enable of EXTINT1" mask="0x2"/>
          <bitfield name="DEBOUNCEN2" caption="Debouncer Enable of EXTINT2" mask="0x4"/>
          <bitfield name="DEBOUNCEN3" caption="Debouncer Enable of EXTINT3" mask="0x8"/>
          <bitfield name="DEBOUNCEN4" caption="Debouncer Enable of EXTINT4" mask="0x10"/>
          <bitfield name="DEBOUNCEN5" caption="Debouncer Enable of EXTINT5" mask="0x20"/>
          <bitfield name="DEBOUNCEN6" caption="Debouncer Enable of EXTINT6" mask="0x40"/>
          <bitfield name="DEBOUNCEN7" caption="Debouncer Enable of EXTINT7" mask="0x80"/>
          <bitfield name="DEBOUNCEN8" caption="Debouncer Enable of EXTINT8" mask="0x100"/>
          <bitfield name="DEBOUNCEN9" caption="Debouncer Enable of EXTINT9" mask="0x200"/>
          <bitfield name="DEBOUNCEN10" caption="Debouncer Enable of EXTINT10" mask="0x400"/>
          <bitfield name="DEBOUNCEN11" caption="Debouncer Enable of EXTINT11" mask="0x800"/>
          <bitfield name="DEBOUNCEN12" caption="Debouncer Enable of EXTINT12" mask="0x1000"/>
          <bitfield name="DEBOUNCEN13" caption="Debouncer Enable of EXTINT13" mask="0x2000"/>
          <bitfield name="DEBOUNCEN14" caption="Debouncer Enable of EXTINT14" mask="0x4000"/>
          <bitfield name="DEBOUNCEN15" caption="Debouncer Enable of EXTINT15" mask="0x8000"/>
        </register>
        <register name="DPRESCALER" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Debouncer Prescaler">
          <bitfield name="PRESCALER0" caption="Debouncer Prescaler" mask="0x7" values="EIC_DPRESCALER__PRESCALER"/>
          <bitfield name="STATES0" caption="Debouncer number of states" mask="0x8" values="EIC_DPRESCALER__STATES"/>
          <bitfield name="PRESCALER1" caption="Debouncer Prescaler" mask="0x70" values="EIC_DPRESCALER__PRESCALER"/>
          <bitfield name="STATES1" caption="Debouncer number of states" mask="0x80" values="EIC_DPRESCALER__STATES"/>
          <bitfield name="TICKON" caption="Pin Sampler frequency selection" mask="0x10000" values="EIC_DPRESCALER__TICKON"/>
        </register>
        <register name="PINSTATE" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Pin State">
          <bitfield name="PINSTATE0" caption="Pin State of EXTINT0" mask="0x1"/>
          <bitfield name="PINSTATE1" caption="Pin State of EXTINT1" mask="0x2"/>
          <bitfield name="PINSTATE2" caption="Pin State of EXTINT2" mask="0x4"/>
          <bitfield name="PINSTATE3" caption="Pin State of EXTINT3" mask="0x8"/>
          <bitfield name="PINSTATE4" caption="Pin State of EXTINT4" mask="0x10"/>
          <bitfield name="PINSTATE5" caption="Pin State of EXTINT5" mask="0x20"/>
          <bitfield name="PINSTATE6" caption="Pin State of EXTINT6" mask="0x40"/>
          <bitfield name="PINSTATE7" caption="Pin State of EXTINT7" mask="0x80"/>
          <bitfield name="PINSTATE8" caption="Pin State of EXTINT8" mask="0x100"/>
          <bitfield name="PINSTATE9" caption="Pin State of EXTINT9" mask="0x200"/>
          <bitfield name="PINSTATE10" caption="Pin State of EXTINT10" mask="0x400"/>
          <bitfield name="PINSTATE11" caption="Pin State of EXTINT11" mask="0x800"/>
          <bitfield name="PINSTATE12" caption="Pin State of EXTINT12" mask="0x1000"/>
          <bitfield name="PINSTATE13" caption="Pin State of EXTINT13" mask="0x2000"/>
          <bitfield name="PINSTATE14" caption="Pin State of EXTINT14" mask="0x4000"/>
          <bitfield name="PINSTATE15" caption="Pin State of EXTINT15" mask="0x8000"/>
        </register>
      </register-group>
      <value-group name="EIC_CTRLA__CKSEL">
        <value name="CLK_GCLK" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_ULP32K" caption="Clocked by ULP32K" value="1"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMIASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_ASYNCH__ASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__PRESCALER">
        <value name="DIV2" caption="EIC clock divided by 2" value="0x0"/>
        <value name="DIV4" caption="EIC clock divided by 4" value="0x1"/>
        <value name="DIV8" caption="EIC clock divided by 8" value="0x2"/>
        <value name="DIV16" caption="EIC clock divided by 16" value="0x3"/>
        <value name="DIV32" caption="EIC clock divided by 32" value="0x4"/>
        <value name="DIV64" caption="EIC clock divided by 64" value="0x5"/>
        <value name="DIV128" caption="EIC clock divided by 128" value="0x6"/>
        <value name="DIV256" caption="EIC clock divided by 256" value="0x7"/>
      </value-group>
