Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/atdf/PIC32CM5164JH01032.atdf
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_INTFLAG__ERROR">
        <value name="Val_0" caption="No errors have been received since the last clear" value="0x0"/>
        <value name="Val_1" caption="At least one error has occurred since the last clear" value="0x1"/>
      </value-group>
      <value-group name="NVMCTRL_INTFLAG__READY">
        <value name="Val_0" caption="The NVM controller is busy programming or erasing." value="0x0"/>
        <value name="Val_1" caption="The NVM controller is ready to accept a new command" value="0x1"/>
      </value-group>
      <value-group name="NVMCTRL_ECCCTRL__ECCDIS">
        <value name="En" caption="Flash ECC is Enabled" value="0x0"/>
        <value name="Dis" caption="Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset" value="0x1"/>
      </value-group>
      <value-group name="NVMCTRL_ECCCTRL__ECCDFDIS">
        <value name="En" caption="Data Flash ECC is Enabled" value="0x0"/>
        <value name="Dis" caption="Data Flash ECC is Not Enabled, once written to 1 by user ECC can only be re-enabled only by a reset" value="0x1"/>
      </value-group>
      <value-group name="NVMCTRL_FLTCTRL__FLTEN">
        <value name="Dis" caption="Disables the Write/Read fault injection" value="0x0"/>
        <value name="En" caption="Enables the Write/Read fault injection to occur selected by FLTMD" value="0x1"/>
      </value-group>
      <value-group name="NVMCTRL_FLTCTRL__FLTMD">
        <value name="Val_0" caption="Fault Injection Disabled" value="0x0"/>
        <value name="Val_2" caption="Fault Capture Mode Enabled (Capture the address (in FFLTCAP) and Syndrome in (FFLTSYND))" value="0x2"/>
        <value name="Val_4" caption="Single Fault Injection (at bit selected by FLT1PTR) for Reads" value="0x4"/>
        <value name="Val_5" caption="Double Fault Injection (uses FLT1PTR and FLT2PTR) for Reads" value="0x5"/>
        <value name="Val_6" caption="Single Fault Injection (at bit selected by FLT1PTR) for Writes" value="0x6"/>
        <value name="Val_7" caption="Double Fault Injection (uses FLT1PTR and FLT2PTR) for Writes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_FLTCTRL__FLTRST">
        <value name="Val_0" caption="No Effect" value="0x0"/>
        <value name="Val_1" caption="Resets all FLT SFR bits. {FLTCTRL, FFLTPTR, FFLTADR, FFLTCAP, FFLTPAR, FFLTSYN}" value="0x1"/>
      </value-group>
      <value-group name="NVMCTRL_DBGCTRL__DBGECC">
        <value name="VAL_0" caption="Corrected, INTFLAG is not updated and FLT logic is not updated" value="0x0"/>
        <value name="VAL_1" caption="Not corrected, INTFLAG is not updated, and FLT logic is not updated" value="0x1"/>
        <value name="VAL_2" caption="Corrected, INTFLAG is updated and FLT logic operates as setup" value="0x2"/>
        <value name="VAL_3" caption="Not corrected, INTFLAG is not updated, and FLT logic is not updated" value="0x3"/>
      </value-group>
    </module>
    <module name="FUSES" id="03929" version="1a0" caption="Non-Volatile Fuses">
      <register-group name="LOCKBIT_FUSES">
        <register name="LOCKBIT_WORD_0" offset="0x0" rw="R" size="4" caption="LOCKBIT Page Word 0">
          <bitfield name="NVMCTRL_CEHL" caption="CEHL Bits" mask="0x3F000000"/>
        </register>
      </register-group>
      <register-group name="OTP1_FUSES">
        <register name="OTP1_WORD_0" offset="0x0" rw="R" size="4" caption="OTP1 Page Word 0">
          <bitfield name="NVMCTRL_NVM_LOCK" caption="NVM Lock" mask="0xFF"/>
          <bitfield name="NVMCTRL_PSZ" caption="NVM Page Size" mask="0x300"/>
          <bitfield name="NVMCTRL_NVMP" caption="Number of NVM Pages" mask="0x3FFF0000"/>
        </register>
        <register name="OTP1_WORD_1" offset="0x4" rw="R" size="4" caption="OTP1 Page Word 1">
          <bitfield name="NVMCTRL_DATAFLASHP" caption="Number of Data Flash Pages" mask="0xFF"/>
        </register>
      </register-group>
      <register-group name="OTP2_FUSES">
        <register name="OTP2_WORD_1" offset="0x4" rw="R" size="4" caption="OTP2 Page Word 1">
          <bitfield name="NVMCTRL_ECCDIS_NOTPRESENT" caption="Allows the ECC disable bit (ECCCTRL.ECCDIS) to become not available for the user with a device fuse." mask="0x10000"/>
          <bitfield name="NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT" caption="Allows the ECC Data Flash disable bit (ECCCTRL.ECCDFDIS) to become not available for the user with a device fuse." mask="0x20000"/>
          <bitfield name="NVMCTRL_CEHL_NOTPRESENT" caption="Allows the CEHL bit to be able to be used by the user to Chip Erase Hard Lock or disabled and no Chip Erase Hard lock allowed." mask="0x40000"/>
        </register>
      </register-group>
      <register-group name="OTP3_FUSES">
        <register name="OTP3_WORD_1" offset="0x4" rw="R" size="4" caption="OTP3 Page Word 1">
          <bitfield name="NVMCTRL_DUMMY2" caption="Dummy for OTP3 entry" mask="0x80000000"/>
        </register>
      </register-group>
      <register-group name="OTP4_FUSES">
        <register name="OTP4_WORD_1" offset="0x4" rw="R" size="4" caption="OTP4 Page Word 1">
          <bitfield name="NVMCTRL_DUMMY" caption="Dummy for OTP4 entry" mask="0x80000000"/>
        </register>
      </register-group>
      <register-group name="OTP5_FUSES">
        <register name="OTP5_WORD_0" offset="0x0" rw="R" size="4" caption="OTP5 Page Word 0">
          <bitfield name="ADC0_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC0_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="ADC1_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x1C0"/>
          <bitfield name="ADC1_BIASCOMP" caption="ADC Comparator Scaling" mask="0xE00"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0xF" values="USER_FUSES_NVMCTRL__BOOTPROT"/>
          <bitfield name="BODVDDUSERLEVEL" caption="BODVDD User Level" mask="0x3F00"/>
          <bitfield name="BODVDD_DIS" caption="BODVDD Disable" mask="0x4000" values="SUPC_BODVDD__DIS"/>
          <bitfield name="BODVDD_ACTION" caption="BODVDD Action" mask="0x18000" values="SUPC_BODVDD__ACTION"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000" values="WDT__ENABLE"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000" values="WDT__ALWAYSON"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000" values="WDT_CONFIG__PER"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF" values="WDT_CONFIG__WINDOW"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0" values="WDT_EWCTRL__EWOFFSET"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100" values="WDT__WEN"/>
          <bitfield name="BODVDD_HYST" caption="BODVDD Hysterisis" mask="0x200" values="SUPC_BODVDD__HYST"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region lock bits" mask="0xFFFF0000"/>
        </register>
      </register-group>
      <value-group name="USER_FUSES_NVMCTRL__BOOTPROT">
        <value name="SIZE_0BYTES" caption="0 Bytes" value="0xF"/>
        <value name="SIZE_512BYTES" caption="512 Bytes" value="0xE"/>
        <value name="SIZE_1024BYTES" caption="1024 Bytes" value="0xD"/>
        <value name="SIZE_2048BYTES" caption="2048 Bytes" value="0xC"/>
        <value name="SIZE_4096BYTES" caption="4096 Bytes" value="0xB"/>
        <value name="SIZE_8192BYTES" caption="8192 Bytes" value="0xA"/>
        <value name="SIZE_16384BYTES" caption="16384 Bytes" value="0x9"/>
        <value name="SIZE_32768BYTES" caption="32768 Bytes" value="0x8"/>
        <value name="SIZE_40960BYTES" caption="40960 Bytes" value="0x7"/>
        <value name="SIZE_49152BYTES" caption="49152 Bytes" value="0x6"/>
        <value name="SIZE_57344BYTES" caption="57344 Bytes" value="0x5"/>
        <value name="SIZE_65536BYTES" caption="65536 Bytes" value="0x4"/>
        <value name="SIZE_73728BYTES" caption="73728 Bytes" value="0x3"/>
        <value name="SIZE_81920BYTES" caption="81920 Bytes" value="0x2"/>
        <value name="SIZE_90112BYTES" caption="90112 Bytes" value="0x1"/>
        <value name="SIZE_98304BYTES" caption="98304 Bytes" value="0x0"/>
      </value-group>
      <value-group name="SUPC_BODVDD__DIS">
        <value name="ENABLED" caption="BODVDD is enabled on power on" value="0x0"/>
        <value name="DISABLED" caption="BODVDD is disabled on power on" value="0x1"/>
      </value-group>
