Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/atdf/PIC32CM5164JH01032.atdf
        <register modes="MODE0" name="CTRLB" offset="0x2" rw="RW" size="2" initval="0x0000" caption="MODE0 Control B">
          <bitfield name="GP0EN" caption="General Purpose 0 Enable" mask="0x1"/>
        </register>
        <register modes="MODE1" name="CTRLB" offset="0x2" rw="RW" size="2" initval="0x0000" caption="MODE1 Control B">
          <bitfield name="GP0EN" caption="General Purpose 0 Enable" mask="0x1"/>
        </register>
        <register modes="MODE2" name="CTRLB" offset="0x2" rw="RW" size="2" initval="0x0000" caption="MODE2 Control B">
          <bitfield name="GP0EN" caption="General Purpose 0 Enable" mask="0x1"/>
        </register>
        <register modes="MODE0" name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE0 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
          <bitfield name="PERDEO" caption="Periodic Interval Daily Event Output Enable" mask="0x1000000"/>
        </register>
        <register modes="MODE1" name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE1 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
          <bitfield name="PERDEO" caption="Periodic Interval Daily Event Output Enable" mask="0x1000000"/>
        </register>
        <register modes="MODE2" name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE2 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="ALARMEO0" caption="Alarm 0 Event Output Enable" mask="0x100"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
          <bitfield name="PERDEO" caption="Periodic Interval Daily Event Output Enable" mask="0x1000000"/>
        </register>
        <register modes="MODE0" name="INTENCLR" offset="0x8" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="MODE0 Interrupt Enable Clear">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="INTENCLR" offset="0x8" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="MODE1 Interrupt Enable Clear">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
